Revit 2026 API

# ParameterSet(Double) Method

---

Sets the parameter to a new real number value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Set(
	double value
)
```
```vb
Public Function Set (
	value As Double
) As Boolean
```
```cpp
public:
bool Set(
	double value
)
```
```fsharp
member Set :
        value : float -> bool
```

#### Parameters

value Double
    The new double value to which the parameter is to be set.

#### Return Value

BooleanThe Set method will return True if the parameter was successfully set to the new value, otherwise false.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The parameter is read-only. |
| ArgumentException | Value must be a finite number. |

You should only use this method if the StorageType property reports the type of the parameter as a Double.

#### Reference

Parameter Class

Set Overload

Autodesk.Revit.DB Namespace